[
  {
    "template": "# Introduction\n\n### Write something nice here!\n\n>First off, thank you for considering contributing to Active Admin. It's people like you that make Active Admin such a great tool.\n\n[source: [Active Admin](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md)] **Need more inspiration?** [1] [Read The Docs](http://read-the-docs.readthedocs.org/en/latest/contribute.html) [2] [Mustache.js](https://github.com/janl/mustache.js/#contributing)\n\n### Tell them why they should read your guidelines.\n\n>Following these guidelines helps to communicate that you respect the time of the developers managing and developing this open source project. In return, they should reciprocate that respect in addressing your issue, assessing changes, and helping you finalize your pull requests.\n\n[source: [Hoodie](https://github.com/hoodiehq/hoodie/blob/master/CONTRIBUTING.md)]\n\n### Explain what kinds of contributions you are looking for.\n\nKeep an open mind! Improving documentation, bug triaging, or writing tutorials are all examples of helpful contributions that mean less work for you.\n\n> Elasticsearch is an open source project and we love to receive contributions from our community — you! There are many ways to contribute, from writing tutorials or blog posts, improving the documentation, submitting bug reports and feature requests or writing code which can be incorporated into Elasticsearch itself.\n\n[source: [Elasticsearch](https://github.com/elastic/elasticsearch/blob/master/CONTRIBUTING.md)] **Need more inspiration?** [1] [Devise](https://github.com/plataformatec/devise/wiki/Contributing) [2] [Geocoder](https://github.com/alexreisner/geocoder#known-issues) (“known issues”)\n\n### Explain contributions you are NOT looking for (if any).\n\nAgain, defining this up front means less work for you. If someone ignores your guide and submits something you don’t want, you can simply close it and point to your policy.\n\n> Please, don't use the issue tracker for [support questions]. Check whether the #pocoo IRC channel on Freenode can help with your issue. If your problem is not strictly Werkzeug or Flask specific, #python is generally more active. Stack Overflow is also worth considering.\n\n[source: [Flask](https://github.com/pallets/flask/blob/master/CONTRIBUTING.rst)] **Need more inspiration?** [1] [cucumber-ruby](https://github.com/cucumber/cucumber-ruby/blob/master/CONTRIBUTING.md#about-to-create-a-new-github-issue) [2] [Read the Docs](http://read-the-docs.readthedocs.org/en/latest/open-source-philosophy.html#unsupported)\n\n# Ground Rules\n### Set expectations for behavior (yours, and theirs).\nThis includes not just how to communicate with others (being respectful, considerate, etc) but also technical responsibilities (importance of testing, project dependencies, etc). Mention and link to your code of conduct, if you have one.\n\n> Responsibilities\n> * Ensure cross-platform compatibility for every change that's accepted. Windows, Mac, Debian & Ubuntu Linux.\n> * Ensure that code that goes into core meets all requirements in this checklist: https://gist.github.com/audreyr/4feef90445b9680475f2\n> * Create issues for any major changes and enhancements that you wish to make. Discuss things transparently and get community feedback.\n> * Don't add any classes to the codebase unless absolutely needed. Err on the side of using functions.\n> * Keep feature versions as small as possible, preferably one new feature per version.\n> * Be welcoming to newcomers and encourage diverse new contributors from all backgrounds. See the [Python Community Code of Conduct](https://www.python.org/psf/codeofconduct/).\n\n[source: [cookiecutter](https://github.com/audreyr/cookiecutter/blob/master/CONTRIBUTING.rst)] **Need more inspiration?** [1] [Celery](https://github.com/celery/celery/blob/master/CONTRIBUTING.rst#community-code-of-conduct) [2] [geocoder](https://github.com/alexreisner/geocoder#contributing)\n\n# Your First Contribution\nHelp people who are new to your project understand where they can be most helpful. This is also a good time to let people know if you follow a label convention for flagging beginner issues.\n\n> Unsure where to begin contributing to Atom? You can start by looking through these beginner and help-wanted issues:\n> Beginner issues - issues which should only require a few lines of code, and a test or two.\n> Help wanted issues - issues which should be a bit more involved than beginner issues.\n> Both issue lists are sorted by total number of comments. While not perfect, number of comments is a reasonable proxy for impact a given change will have.\n\n[source: [Atom](https://github.com/atom/atom/blob/master/CONTRIBUTING.md#your-first-code-contribution)] **Need more inspiration?** [1] [Read the Docs](http://docs.readthedocs.org/en/latest/contribute.html#contributing-to-development) [2] [Django](https://docs.djangoproject.com/en/dev/internals/contributing/new-contributors/#first-steps) (scroll down to \"Guidelines\" as well)\n\n### Bonus points: Add a link to a resource for people who have never contributed to open source before.\nHere are a couple of friendly tutorials you can include: http://makeapullrequest.com/ and http://www.firsttimersonly.com/\n\n> Working on your first Pull Request? You can learn how from this *free* series, [How to Contribute to an Open Source Project on GitHub](https://egghead.io/series/how-to-contribute-to-an-open-source-project-on-github).\n\n[source: [React](https://github.com/facebook/react/blob/master/CONTRIBUTING.md#pull-requests)]  \n\n# Getting started\n### Give them a quick walkthrough of how to submit a contribution.\nHow you write this is up to you, but some things you may want to include:\n\n* Let them know if they need to sign a CLA, agree to a DCO, or get any other legal stuff out of the way\n* If tests are required for contributions, let them know, and explain how to run the tests\n* If you use anything other than GitHub to manage issues (ex. JIRA or Trac), let them know which tools they’ll need to contribute\n\n>For something that is bigger than a one or two line fix:\n\n>1. Create your own fork of the code\n>2. Do the changes in your fork\n>3. If you like the change and think the project could use it:\n>    * Be sure you have followed the code style for the project.\n>    * Sign the Contributor License Agreement, CLA, with the jQuery Foundation.\n>    * Note the jQuery Foundation Code of Conduct.\n>    * Send a pull request indicating that you have a CLA on file.\n\n[source: [Requirejs](http://requirejs.org/docs/contributing.html)] **Need more inspiration?** [1] [Active Admin](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md#1-where-do-i-go-from-here) [2] [Node.js](https://github.com/nodejs/node/blob/master/CONTRIBUTING.md#code-contributions) [3] [Ember.js](https://github.com/emberjs/emberjs/blobmaster/CONTRIBUTING.md#pull-requests)\n\n### If you have a different process for small or \"obvious\" fixes, let them know.\n\n> Small contributions such as fixing spelling errors, where the content is small enough to not be considered intellectual property, can be submitted by a contributor as a patch, without a CLA.\n>  \n>As a rule of thumb, changes are obvious fixes if they do not introduce any new functionality or creative thinking. As long as the change does not affect functionality, some likely examples include the following:\n>* Spelling / grammar fixes\n>* Typo correction, white space and formatting changes\n>* Comment clean up\n>* Bug fixes that change default return values or error codes stored in constants\n>* Adding logging messages or debugging output\n>* Changes to ‘metadata’ files like Gemfile, .gitignore, build scripts, etc.\n>* Moving source files from one directory or package to another\n\n[source: [Chef](https://github.com/chef/chef/blob/master/CONTRIBUTING.md#chef-obvious-fix-policy)] **Need more inspiration?** [1] [Puppet](https://github.com/puppetlabs/puppet/blob/master/StandardIssueLabels#standardissuelabels) [2] [Atom](https://github.com/atom/atom/blobmaster/CON(TRIBUTING.md#reporting-bugs)  \n\n# How to report a bug\n### Explain security disclosures first!\nAt bare minimum, include this sentence:\n> If you find a security vulnerability, do NOT open an issue. Email XXXX instead.\n\nIf you don’t want to use your personal contact information, set up a “security@” email address. Larger projects might have more formal processes for disclosing security, including encrypted communication. (Disclosure: I am not a security expert.)\n\n> Any security issues should be submitted directly to security@travis-ci.org\n> In order to determine whether you are dealing with a security issue, ask yourself these two questions:\n> * Can I access something that's not mine, or something I shouldn't have access to?\n> * Can I disable something for other people?\n>  \n>If the answer to either of those two questions are \"yes\", then you're probably dealing with a security issue. Note that even if you answer \"no\" to both questions you may still be dealing with a security issue, so if you're unsure, just email us at security@travis-ci.org.\n\n[source: [Travis CI](https://github.com/travis-ci/travis-ci/blob/master/CONTRIBUTING.md#filing-issues)] **Need more inspiration?** [1] [Celery](https://github.com/celery/celery/blob/master/contributing.rst#security) [2] [Express.js](https://github.com/expressjs/express/blobmaster/Security.md)\n",
    "type": "https://github.com/nayafia/contributing-template",
    "name": "Contributing Template"
  },
  {
    "template": "",
    "type": "custom",
    "name": "Custom"
  }
]
